"use client";

import React from "react";

const ShoppingPolicy = () => {
  return (
    <div className="max-w-4xl mx-auto p-6">
      <h1 className="text-3xl font-bold mb-6 text-center text-red-500">
        Худалдан авалтын бодлого
      </h1>

      <section className="mb-8">
        <h2 className="text-xl font-semibold mb-2 text-red-500">
          Хүргэлтийн бодлого
        </h2>
        <li>
          бүх дотоодын захиалгад ҮНЭГҮЙ хүргэлт санал болгодог. Гэхдээ хүргэхэд
          хүндрэлтэй байршилд хүргэлт хийх шаардлагатай бол тухайн хүргэлтийн
          компанийн бодит зардлыг хэрэглэгчээс нэхэмжилнэ.
        </li>
        <li>Таны захиалга бүрэн даатгагдсан байдлаар илгээгдэнэ.</li>
        <li>
          Барааг хүлээн авахдаа хайрцгийг сайтар шалгаж, эвдэрч гэмтсэн эсэхийг
          нягталж, дараа нь хүлээн авна уу.
        </li>
        <li>
          Захиалга 7–8 ажлын өдрийн дотор илгээгдэнэ. Хүргэлт 3–5 ажлын өдрийн
          дотор хийгдэнэ.
        </li>
      </section>

      <section className="mb-8">
        <h2 className="text-xl font-semibold text-red-500 mb-2">
          Хаяг өөрчлөх бодлого
        </h2>
        <li>
          Хүргэлтийн хаягийг зөвхөн баталгаажуулалтын имэйл илгээгдээгүй байхад
          өөрчлөх боломжтой. Имэйл илгээгдсэний дараа хаяг өөрчлөх боломжгүй.
        </li>
      </section>

      <section className="mb-8">
        <h2 className="text-xl font-semibold text-red-500 mb-2">
          Хүргэлтийн заавар
        </h2>
        <li>
          Хайрцаг задрах, хоосон байх тохиолдолд хүлээн авахаас татгалзана уу.
        </li>
        <li>
          Хүлээн авагч барааг хүлээн авахын өмнө хайрцгийг задлан шалгаж үзэх
          ёстой.
        </li>
        <li>
          Хэрэв хүлээн авагч байхгүй бол хүргэлтийн компани 3 удаа дахин оролдох
          ба үүний дараа буцаана. Дахин хүргэлтийн зардлыг хэрэглэгч хариуцна.
        </li>
        <li>
          Олон улсын захиалгын хувьд импортын татвар, хураамжийг хэрэглэгч
          төлнө.
        </li>
      </section>

      <section className="mb-8">
        <h2 className="text-xl font-semibold text-red-500 mb-2">
          Бэлэн төлбөрт хүргэлтийн (COD) бодлого
        </h2>
        <ul className="list-disc ml-5">
          <li>COD үйлчилгээг байршлаас шалтгаалан санал болгоно.</li>
          <li>
            Өмнө нь COD захиалгаа төлөөгүй хэрэглэгчдэд энэ үйлчилгээний эрхийг
            хязгаарлах боломжтой.
          </li>
          <li>
            COD захиалгыг тогтмол буцааж байсан хэрэглэгчдийн COD хүсэлтийг
            цаашид батлахгүй байж болно.
          </li>
          <li>
            Луйврын шинжтэй эсвэл сэжигтэй үйлдэл илэрсэн тохиолдолд COD
            үйлчилгээг цуцлах эрхтэй.
          </li>
        </ul>
        <p>
          Хэрэв COD зөвшөөрөгдөөгүй бол захиалга хийх үеэр хэрэглэгчид мэдэгдэж,
          бусад төлбөрийн хувилбаруудыг санал болгоно.
        </p>
      </section>
    </div>
  );
};

export default ShoppingPolicy;
