interface Product {
  id: number;
  name: string | "";
  sale?: string;
  price: number;
  rating: number;
  reviews: number;
  answers: number;
  inStock: boolean;
  delivery: string;
  deliveryDate: string;
  category: string;
  video?: string;
  model: string;
  images: string[];
  features: string[];
  description: string;
  chartData: ChartData[];
}

interface ChartData {
  month: string;
  revenue: number;
}

export const products: Product[] = [
  {
    id: 1,
    name: "Витагрипп Чацарганатай 20гр",
    price: 2899,
    rating: 5,
    reviews: 1500,
    answers: 120,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "9-12 ажлын өдөр",
    category: "Эм",
    model: "Ханиадны эм",
    images: [
      "/detailphotos/1.png",
      "/detailphotos/1.png",
      "/detailphotos/1.png",
      "/detailphotos/1.png",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 446,
      },
      {
        month: "Feb",
        revenue: 989,
      },
      {
        month: "Mar",
        revenue: 446,
      },
      {
        month: "Apr",
        revenue: 329,
      },
      {
        month: "May",
        revenue: 840,
      },
      {
        month: "Jun",
        revenue: 547,
      },
      {
        month: "Jul",
        revenue: 790,
      },
      {
        month: "Aug",
        revenue: 804,
      },
      {
        month: "Sep",
        revenue: 725,
      },
      {
        month: "Oct",
        revenue: 837,
      },
      {
        month: "Nov",
        revenue: 467,
      },
      {
        month: "Dec",
        revenue: 945,
      },
    ],
  },
  {
    id: 2,
    name: "Залтирон 10мл",
    price: 3199,
    rating: 4.5,
    reviews: 120,
    answers: 50,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "9-12 ажлын өдөр",
    category: "Тариа",
    model: "Үе мөчний тариа",
    images: [
      "/detailphotos/2.jpg",
      "/detailphotos/2.jpg",
      "/detailphotos/2.jpg",
      "/detailphotos/2.jpg",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 813,
      },
      {
        month: "Feb",
        revenue: 543,
      },
      {
        month: "Mar",
        revenue: 216,
      },
      {
        month: "Apr",
        revenue: 626,
      },
      {
        month: "May",
        revenue: 225,
      },
      {
        month: "Jun",
        revenue: 167,
      },
      {
        month: "Jul",
        revenue: 377,
      },
      {
        month: "Aug",
        revenue: 534,
      },
      {
        month: "Sep",
        revenue: 783,
      },
      {
        month: "Oct",
        revenue: 550,
      },
      {
        month: "Nov",
        revenue: 748,
      },
      {
        month: "Dec",
        revenue: 283,
      },
    ],
  },
  {
    id: 3,
    name: "Терафлюы",
    price: 4899,
    rating: 3.5,
    reviews: 700,
    answers: 234,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "9-12 ажлын өдөр",
    category: "Эм",
    model: "Ханиадны эм",
    images: [
      "/detailphotos/3.png",
      "/detailphotos/3.png",
      "/detailphotos/3.png",
      "/detailphotos/3.png",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 515,
      },
      {
        month: "Feb",
        revenue: 805,
      },
      {
        month: "Mar",
        revenue: 485,
      },
      {
        month: "Apr",
        revenue: 798,
      },
      {
        month: "May",
        revenue: 299,
      },
      {
        month: "Jun",
        revenue: 930,
      },
      {
        month: "Jul",
        revenue: 182,
      },
      {
        month: "Aug",
        revenue: 618,
      },
      {
        month: "Sep",
        revenue: 109,
      },
      {
        month: "Oct",
        revenue: 159,
      },
      {
        month: "Nov",
        revenue: 883,
      },
      {
        month: "Dec",
        revenue: 317,
      },
    ],
  },
  {
    id: 4,
    name: "Ацц 600мг уусдаг шахмал",
    price: 4299,
    rating: 2.6,
    reviews: 520,
    answers: 34,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "9-12 ажлын өдөр",
    category: "Эм",
    model: "Ханиадны эм",
    images: [
      "/detailphotos/4.jpg",
      "/detailphotos/4.jpg",
      "/detailphotos/4.jpg",
      "/detailphotos/4.jpg",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 326,
      },
      {
        month: "Feb",
        revenue: 382,
      },
      {
        month: "Mar",
        revenue: 410,
      },
      {
        month: "Apr",
        revenue: 555,
      },
      {
        month: "May",
        revenue: 787,
      },
      {
        month: "Jun",
        revenue: 196,
      },
      {
        month: "Jul",
        revenue: 866,
      },
      {
        month: "Aug",
        revenue: 379,
      },
      {
        month: "Sep",
        revenue: 197,
      },
      {
        month: "Oct",
        revenue: 330,
      },
      {
        month: "Nov",
        revenue: 537,
      },
      {
        month: "Dec",
        revenue: 288,
      },
    ],
  },
  {
    id: 5,
    name: "Кардионат 250мг",
    price: 4899,
    rating: 5,
    reviews: 1200,
    answers: 234,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "9-12 ажлын өдөр",
    category: "Эм",
    model: "Зүрхний эм",
    images: [
      "/detailphotos/5.jpeg",
      "/detailphotos/5.jpg",
      "/detailphotos/5.jpg",
      "/detailphotos/5.jpg",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 281,
      },
      {
        month: "Feb",
        revenue: 783,
      },
      {
        month: "Mar",
        revenue: 211,
      },
      {
        month: "Apr",
        revenue: 676,
      },
      {
        month: "May",
        revenue: 825,
      },
      {
        month: "Jun",
        revenue: 806,
      },
      {
        month: "Jul",
        revenue: 266,
      },
      {
        month: "Aug",
        revenue: 724,
      },
      {
        month: "Sep",
        revenue: 279,
      },
      {
        month: "Oct",
        revenue: 423,
      },
      {
        month: "Nov",
        revenue: 482,
      },
      {
        month: "Dec",
        revenue: 808,
      },
    ],
  },
  {
    id: 6,
    name: "Нейромалин 50мг",
    price: 4799,
    rating: 4.5,
    reviews: 900,
    answers: 234,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "9-12 ажлын өдөр",
    category: "Тариа",
    model: "Үе мөчний тариа",
    images: [
      "/detailphotos/6.jpg",
      "/detailphotos/6.jpg",
      "/detailphotos/6.jpg",
      "/detailphotos/6.jpg",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 668,
      },
      {
        month: "Feb",
        revenue: 946,
      },
      {
        month: "Mar",
        revenue: 468,
      },
      {
        month: "Apr",
        revenue: 537,
      },
      {
        month: "May",
        revenue: 776,
      },
      {
        month: "Jun",
        revenue: 155,
      },
      {
        month: "Jul",
        revenue: 137,
      },
      {
        month: "Aug",
        revenue: 659,
      },
      {
        month: "Sep",
        revenue: 745,
      },
      {
        month: "Oct",
        revenue: 155,
      },
      {
        month: "Nov",
        revenue: 684,
      },
      {
        month: "Dec",
        revenue: 836,
      },
    ],
  },
  {
    id: 7,
    name: "Ясурамин 10мл",
    price: 4999,
    rating: 4,
    reviews: 800,
    answers: 234,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "9-12 ажлын өдөр",
    category: "Тариа",
    model: "Үе мөчний тариа",
    images: [
      "/detailphotos/7.png",
      "/detailphotos/7.png",
      "/detailphotos/7.png",
      "/detailphotos/7.png",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 446,
      },
      {
        month: "Feb",
        revenue: 767,
      },
      {
        month: "Mar",
        revenue: 577,
      },
      {
        month: "Apr",
        revenue: 511,
      },
      {
        month: "May",
        revenue: 165,
      },
      {
        month: "Jun",
        revenue: 795,
      },
      {
        month: "Jul",
        revenue: 759,
      },
      {
        month: "Aug",
        revenue: 595,
      },
      {
        month: "Sep",
        revenue: 516,
      },
      {
        month: "Oct",
        revenue: 332,
      },
      {
        month: "Nov",
        revenue: 678,
      },
      {
        month: "Dec",
        revenue: 909,
      },
    ],
  },
  {
    id: 8,
    name: "Цефазолин 1гр",
    price: 3399,
    rating: 4.2,
    reviews: 850,
    answers: 234,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "5-7 ажлын өдөр",
    category: "Тариа",
    model: "Үрэвслийн эсрэг тариа",
    images: [
      "/detailphotos/8.jpg",
      "/detailphotos/8.jpg",
      "/detailphotos/8.jpg",
      "/detailphotos/8.jpg",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 885,
      },
      {
        month: "Feb",
        revenue: 709,
      },
      {
        month: "Mar",
        revenue: 627,
      },
      {
        month: "Apr",
        revenue: 878,
      },
      {
        month: "May",
        revenue: 837,
      },
      {
        month: "Jun",
        revenue: 509,
      },
      {
        month: "Jul",
        revenue: 912,
      },
      {
        month: "Aug",
        revenue: 352,
      },
      {
        month: "Sep",
        revenue: 391,
      },
      {
        month: "Oct",
        revenue: 890,
      },
      {
        month: "Nov",
        revenue: 378,
      },
      {
        month: "Dec",
        revenue: 533,
      },
    ],
  },
  {
    id: 9,
    name: "Предизин 35мг",
    price: 1499,
    rating: 4.3,
    reviews: 860,
    answers: 234,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "9-12 ажлын өдөр",
    category: "Эм",
    model: "Зүрхний эм",
    images: [
      "/detailphotos/9.jpg",
      "/detailphotos/9.jpg",
      "/detailphotos/9.jpg",
      "/detailphotos/9.jpg",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 712,
      },
      {
        month: "Feb",
        revenue: 675,
      },
      {
        month: "Mar",
        revenue: 926,
      },
      {
        month: "Apr",
        revenue: 108,
      },
      {
        month: "May",
        revenue: 584,
      },
      {
        month: "Jun",
        revenue: 651,
      },
      {
        month: "Jul",
        revenue: 129,
      },
      {
        month: "Aug",
        revenue: 454,
      },
      {
        month: "Sep",
        revenue: 776,
      },
      {
        month: "Oct",
        revenue: 597,
      },
      {
        month: "Nov",
        revenue: 174,
      },
      {
        month: "Dec",
        revenue: 536,
      },
    ],
  },
  {
    id: 10,
    name: "Цефтриаксон 1гр",
    price: 4899,
    rating: 4.2,
    reviews: 830,
    answers: 234,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "9-12 ажлын өдөр",
    category: "Тариа",
    model: "Үрэвслийн эсрэг тариа",
    images: [
      "/detailphotos/10.jpg",
      "/detailphotos/10.jpg",
      "/detailphotos/10.jpg",
      "/detailphotos/10.jpg",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 320,
      },
      {
        month: "Feb",
        revenue: 594,
      },
      {
        month: "Mar",
        revenue: 495,
      },
      {
        month: "Apr",
        revenue: 892,
      },
      {
        month: "May",
        revenue: 260,
      },
      {
        month: "Jun",
        revenue: 724,
      },
      {
        month: "Jul",
        revenue: 278,
      },
      {
        month: "Aug",
        revenue: 311,
      },
      {
        month: "Sep",
        revenue: 972,
      },
      {
        month: "Oct",
        revenue: 324,
      },
      {
        month: "Nov",
        revenue: 342,
      },
      {
        month: "Dec",
        revenue: 190,
      },
    ],
  },

  {
    id: 11,
    name: "Нэг удаагын малгай",
    price: 5999,
    rating: 4.5,
    reviews: 740,
    answers: 156,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "5-7 ажлын өдөр",
    category: "Нэг удаагын хэрэгсэл",
    model: "Нэг удаагын хэрэглэл",
    images: [
      "/detailphotos/11.png",
      "/detailphotos/11.png",
      "/detailphotos/11.png",
      "/detailphotos/11.png",
      "/detailphotos/11.png",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 5860,
      },
      {
        month: "Feb",
        revenue: 1300,
      },
      {
        month: "Mar",
        revenue: 2849,
      },
      {
        month: "Apr",
        revenue: 5449,
      },
      {
        month: "May",
        revenue: 7790,
      },
      {
        month: "Jun",
        revenue: 3713,
      },
      {
        month: "Jul",
        revenue: 5802,
      },
      {
        month: "Aug",
        revenue: 9518,
      },
      {
        month: "Sep",
        revenue: 1020,
      },
      {
        month: "Oct",
        revenue: 8313,
      },
      {
        month: "Nov",
        revenue: 9275,
      },
      {
        month: "Dec",
        revenue: 5843,
      },
    ],
  },
  {
    id: 12,
    name: "Маск KF94",
    price: 5999,
    rating: 5,
    reviews: 200,
    answers: 34,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "5-7 ажлын өдөр",
    category: "Нэг удаагын хэрэгсэл",
    model: "Нэг удаагын хэрэглэл",
    images: [
      "/detailphotos/12.jpg",
      "/detailphotos/12.jpg",
      "/detailphotos/12.jpg",
      "/detailphotos/12.jpg",
      "/detailphotos/12.jpg",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 8216,
      },
      {
        month: "Feb",
        revenue: 8600,
      },
      {
        month: "Mar",
        revenue: 6442,
      },
      {
        month: "Apr",
        revenue: 7475,
      },
      {
        month: "May",
        revenue: 2149,
      },
      {
        month: "Jun",
        revenue: 9706,
      },
      {
        month: "Jul",
        revenue: 6919,
      },
      {
        month: "Aug",
        revenue: 7004,
      },
      {
        month: "Sep",
        revenue: 3081,
      },
      {
        month: "Oct",
        revenue: 3032,
      },
      {
        month: "Nov",
        revenue: 3662,
      },
      {
        month: "Dec",
        revenue: 5814,
      },
    ],
  },
  {
    id: 13,
    name: "Уян боолт 10смx4,5м",
    price: 5499,
    rating: 4.2,
    reviews: 1020,
    answers: 304,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "5-7 ажлын өдөр",
    category: "Нэг удаагын хэрэгсэл",
    model: "Нэг удаагын хэрэглэл",
    images: [
      "/detailphotos/13.jpg",
      "/detailphotos/13.jpg",
      "/detailphotos/13.jpg",
      "/detailphotos/13.jpg",
      "/detailphotos/13.jpg",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 5941,
      },
      {
        month: "Feb",
        revenue: 2378,
      },
      {
        month: "Mar",
        revenue: 4888,
      },
      {
        month: "Apr",
        revenue: 6838,
      },
      {
        month: "May",
        revenue: 6765,
      },
      {
        month: "Jun",
        revenue: 5782,
      },
      {
        month: "Jul",
        revenue: 9616,
      },
      {
        month: "Aug",
        revenue: 4010,
      },
      {
        month: "Sep",
        revenue: 8054,
      },
      {
        month: "Oct",
        revenue: 7718,
      },
      {
        month: "Nov",
        revenue: 9264,
      },
      {
        month: "Dec",
        revenue: 7966,
      },
    ],
  },
  {
    id: 14,
    name: "Зүү 1 удаагын 21гр",
    price: 5699,
    rating: 4.6,
    reviews: 745,
    answers: 127,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "5-7 ажлын өдөр",
    category: "Нэг удаагын хэрэгсэл",
    model: "Нэг удаагын эмчилгээний хэрэглэл",
    images: [
      "/detailphotos/14.jpeg",
      "/detailphotos/14.jpeg",
      "/detailphotos/14.jpeg",
      "/detailphotos/14.jpeg",
      "/detailphotos/14.jpeg",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 6189,
      },
      {
        month: "Feb",
        revenue: 5232,
      },
      {
        month: "Mar",
        revenue: 4825,
      },
      {
        month: "Apr",
        revenue: 9224,
      },
      {
        month: "May",
        revenue: 6857,
      },
      {
        month: "Jun",
        revenue: 4785,
      },
      {
        month: "Jul",
        revenue: 3779,
      },
      {
        month: "Aug",
        revenue: 8205,
      },
      {
        month: "Sep",
        revenue: 5596,
      },
      {
        month: "Oct",
        revenue: 7249,
      },
      {
        month: "Nov",
        revenue: 6391,
      },
      {
        month: "Dec",
        revenue: 5739,
      },
    ],
  },
  {
    id: 15,
    name: "Зүү 1 удаагын 22гр",
    price: 5999,
    rating: 4.5,
    reviews: 723,
    answers: 97,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "5-7 ажлын өдөр",
    category: "Нэг удаагын хэрэгсэл",
    model: "Нэг удаагын эмчилгээний хэрэглэл",
    images: [
      "/detailphotos/15.jpg",
      "/detailphotos/15.jpg",
      "/detailphotos/15.jpg",
      "/detailphotos/15.jpg",
      "/detailphotos/15.jpg",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 4217,
      },
      {
        month: "Feb",
        revenue: 8806,
      },
      {
        month: "Mar",
        revenue: 5912,
      },
      {
        month: "Apr",
        revenue: 6154,
      },
      {
        month: "May",
        revenue: 9117,
      },
      {
        month: "Jun",
        revenue: 8776,
      },
      {
        month: "Jul",
        revenue: 7599,
      },
      {
        month: "Aug",
        revenue: 7024,
      },
      {
        month: "Sep",
        revenue: 8607,
      },
      {
        month: "Oct",
        revenue: 5559,
      },
      {
        month: "Nov",
        revenue: 7469,
      },
      {
        month: "Dec",
        revenue: 8374,
      },
    ],
  },
  {
    id: 16,
    name: "Чагнуур хар",
    price: 3299,
    rating: 4.9,
    reviews: 1203,
    answers: 345,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "5-7 ажлын өдөр",
    category: "Захиалгат хэрэгсэл",
    model: "Эмнэлэгийн хэрэгсэл(урт хугацааны)",
    images: [
      "/detailphotos/16.jpg",
      "/detailphotos/16.jpg",
      "/detailphotos/16.jpg",
      "/detailphotos/16.jpg",
      "/detailphotos/16.jpg",
      "/detailphotos/16.jpg",
      "/detailphotos/16.jpg",
    ],
    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 4353,
      },
      {
        month: "Feb",
        revenue: 9585,
      },
      {
        month: "Mar",
        revenue: 9849,
      },
      {
        month: "Apr",
        revenue: 3679,
      },
      {
        month: "May",
        revenue: 2966,
      },
      {
        month: "Jun",
        revenue: 2645,
      },
      {
        month: "Jul",
        revenue: 2561,
      },
      {
        month: "Aug",
        revenue: 7296,
      },
      {
        month: "Sep",
        revenue: 8925,
      },
      {
        month: "Oct",
        revenue: 8388,
      },
      {
        month: "Nov",
        revenue: 1402,
      },
      {
        month: "Dec",
        revenue: 4318,
      },
    ],
  },
  {
    id: 17,
    name: "Санитас төхөөрөмж",
    price: 3299,
    rating: 4.8,
    reviews: 1067,
    answers: 237,
    inStock: true,
    delivery: "Хүргэлт үнэгүй",
    deliveryDate: "5-7 ажлын өдөр",
    category: "Захиалгат хэрэгсэл",
    model: "Эмнэлэгийн төхөөрөмж",
    images: [
      "/detailphotos/17.jpg",
      "/detailphotos/17.jpg",
      "/detailphotos/17.jpg",
    ],

    features: [
      "Ханиадны эм",
      "Хүргэлт : 9-12 ажлын өдөр",
      "Германд үйлдвэрлэсэн.",
      "Үйлдвэрлэсэн он:2024-7-22",
      "Хугацаа дуусах он:2025-7-22",
    ],
    description:
      "\n\nХэрэглэх заавар:Насанд хүрэгсэд 1 уут буюу 20г бэлдмэлийг 200мл халуун бүлээн усанд уусгаж,өдөрт 1 уутыг ууж хэрэглэнэ.\n\nТайлбар:Витагрипп мөхлөгийг ханиад томууны үед эмчилгээний зориулалтаар,халдварт өвчний дараа биемахбодыг тамиржуулах,хордлого тайлах,аксорбины хүчлийн дутагдал зэрэгт загварын дагуу хэрэглэнэ.\n\n Найрлага:Аксорбины хүчил 1000мг агуулагдана. \n\n Анхааруулга:Аксорбины хүчилд хэт мэдрэг хүмүүс,цусны бүлэгнэлт ихэссэн үед,чихрийн шижин өвчин болон бөөр чулуужих өвчин зэрэгт их тунгаар хэрэглэхийг хориглоно.",
    chartData: [
      {
        month: "Jan",
        revenue: 5905,
      },
      {
        month: "Feb",
        revenue: 3177,
      },
      {
        month: "Mar",
        revenue: 5024,
      },
      {
        month: "Apr",
        revenue: 2296,
      },
      {
        month: "May",
        revenue: 2468,
      },
      {
        month: "Jun",
        revenue: 7977,
      },
      {
        month: "Jul",
        revenue: 1363,
      },
      {
        month: "Aug",
        revenue: 1971,
      },
      {
        month: "Sep",
        revenue: 4363,
      },
      {
        month: "Oct",
        revenue: 2843,
      },
      {
        month: "Nov",
        revenue: 9247,
      },
      {
        month: "Dec",
        revenue: 5682,
      },
    ],
  },
];
